MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_gptimer.h
/* GPTIMER_CTR Bits */
/* GPTIMER_CTR[CCTR] Bits */
#define GPTIMER_CTR_CCTR_OFS                     (0)                             /* !< CCTR Offset */
#define GPTIMER_CTR_CCTR_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Current Counter value */
#define GPTIMER_CTR_CCTR_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Minimum value */
#define GPTIMER_CTR_CCTR_MAXIMUM                 ((uint32_t)0xFFFFFFFFU)         /* !< Maximum Value */

/* GPTIMER_CTRCTL Bits */
/* GPTIMER_CTRCTL[EN] Bits */
#define GPTIMER_CTRCTL_EN_OFS                    (0)                             /* !< EN Offset */
#define GPTIMER_CTRCTL_EN_MASK                   ((uint32_t)0x00000001U)         /* !< Counter Enable.  This bit allows
                                                                                    the timer to advance  This bit is
                                                                                    automatically cleared if REPEAT=0 (do
                                                                                    not automatically reload) and the
                                                                                    counter value equals zero.  CPU
                                                                                    Write: A register write that sets the
                                                                                    EN bit, the counter value is set per
                                                                                    the CVAE value. Hardware: This bit
                                                                                    may also be set as the result of an
                                                                                    LCOND or ZCOND condition being met
                                                                                    and the counter value changed to the
                                                                                    load value or zero value,
                                                                                    respectively. */
#define GPTIMER_CTRCTL_EN_DISABLED               ((uint32_t)0x00000000U)         /* !< Disabled */
#define GPTIMER_CTRCTL_EN_ENABLED                ((uint32_t)0x00000001U)         /* !< Enabled */
/* GPTIMER_CTRCTL[REPEAT] Bits */
#define GPTIMER_CTRCTL_REPEAT_OFS                (1)                             /* !< REPEAT Offset */
#define GPTIMER_CTRCTL_REPEAT_MASK               ((uint32_t)0x0000000EU)         /* !< Repeat.  The repeat bit controls
                                                                                    whether the counter continues to
                                                                                    advance following a zero event, or
                                                                                    the exiting of a debug or fault
                                                                                    condition.  If counting down, a zero
                                                                                    event is followed by a load at the
                                                                                    next advance condition. If counting
                                                                                    up-down, a zero event is followed by
                                                                                    an advance event (+1). The intent of
                                                                                    encoding 3 is that if the debug
                                                                                    condition is in effect, the
                                                                                    generation of the load pulse is
                                                                                    deferred until the debug condition is
                                                                                    over. This allows the counter to
                                                                                    reach zero before counting is
                                                                                    suspended. */
#define GPTIMER_CTRCTL_REPEAT_REPEAT_0           ((uint32_t)0x00000000U)         /* !< Does not automatically advance
                                                                                    following a zero event. */
#define GPTIMER_CTRCTL_REPEAT_REPEAT_1           ((uint32_t)0x00000002U)         /* !< Continues to advance following a
                                                                                    zero event. */
#define GPTIMER_CTRCTL_REPEAT_REPEAT_2           ((uint32_t)0x00000004U)         /* !< Reserved */
#define GPTIMER_CTRCTL_REPEAT_REPEAT_3           ((uint32_t)0x00000006U)         /* !< Continues to advance following a
                                                                                    zero event if the debug mode is not
                                                                                    in effect, or following the release
                                                                                    of the debug mode. */
#define GPTIMER_CTRCTL_REPEAT_REPEAT_4           ((uint32_t)0x00000008U)         /* !< Reserved */
/* GPTIMER_CTRCTL[CM] Bits */
#define GPTIMER_CTRCTL_CM_OFS                    (4)                             /* !< CM Offset */
#define GPTIMER_CTRCTL_CM_MASK                   ((uint32_t)0x00000030U)         /* !< Count Mode */
#define GPTIMER_CTRCTL_CM_DOWN                   ((uint32_t)0x00000000U)         /* !< Down */
#define GPTIMER_CTRCTL_CM_UP_DOWN                ((uint32_t)0x00000010U)         /* !< Up/Down */
#define GPTIMER_CTRCTL_CM_UP                     ((uint32_t)0x00000020U)         /* !< Counter counts up. */
/* GPTIMER_CTRCTL[CVAE] Bits */
#define GPTIMER_CTRCTL_CVAE_OFS                  (28)                            /* !< CVAE Offset */
#define GPTIMER_CTRCTL_CVAE_MASK                 ((uint32_t)0x30000000U)         /* !< Counter Value After Enable.  This
                                                                                    field specifies the initialization
                                                                                    condition of the counter when the EN
                                                                                    bit is changed from 0 to 1 by a write
                                                                                    to the CTRCTL register. Note that an
                                                                                    external event can also cause the EN
                                                                                    bit to go active. */
#define GPTIMER_CTRCTL_CVAE_LDVAL                ((uint32_t)0x00000000U)         /* !< The counter is set to the LOAD
                                                                                    register value */
#define GPTIMER_CTRCTL_CVAE_NOCHANGE             ((uint32_t)0x10000000U)         /* !< The counter value is unchanged from
                                                                                    its current value which could have
                                                                                    been initialized by software */
#define GPTIMER_CTRCTL_CVAE_ZEROVAL              ((uint32_t)0x20000000U)         /* !< The counter is set to zero */
/* GPTIMER_CTRCTL[DRB] Bits */
#define GPTIMER_CTRCTL_DRB_OFS                   (17)                            /* !< DRB Offset */
#define GPTIMER_CTRCTL_DRB_MASK                  ((uint32_t)0x00020000U)         /* !< Debug Resume Behavior This bit
                                                                                    specifies what the device does
                                                                                    following the release/exit of debug
                                                                                    mode. */
#define GPTIMER_CTRCTL_DRB_RESUME                ((uint32_t)0x00000000U)         /* !< Resume counting */
#define GPTIMER_CTRCTL_DRB_CVAE_ACTION           ((uint32_t)0x00020000U)         /* !< Perform the action as specified by
                                                                                    the CVAE field. */
/* GPTIMER_CTRCTL[FB] Bits */
#define GPTIMER_CTRCTL_FB_OFS                    (18)                            /* !< FB Offset */
#define GPTIMER_CTRCTL_FB_MASK                   ((uint32_t)0x00040000U)         /* !< Fault Behavior This bit specifies
                                                                                    whether the counter continues running
                                                                                    or suspends during a fault mode.
                                                                                    There is a separate control under
                                                                                    REPEAT to indicate whether counting
                                                                                    is to suspend at next Counter==0 */
#define GPTIMER_CTRCTL_FB_CONT_COUNT             ((uint32_t)0x00000000U)         /* !< Continues counting */
#define GPTIMER_CTRCTL_FB_SUSP_COUNT             ((uint32_t)0x00040000U)         /* !< Suspends counting */
/* GPTIMER_CTRCTL[FRB] Bits */
#define GPTIMER_CTRCTL_FRB_OFS                   (19)                            /* !< FRB Offset */
#define GPTIMER_CTRCTL_FRB_MASK                  ((uint32_t)0x00080000U)         /* !< Fault Resume Behavior This bit
                                                                                    specifies what the device does
                                                                                    following the release/exit of fault
                                                                                    condition. */
#define GPTIMER_CTRCTL_FRB_RESUME                ((uint32_t)0x00000000U)         /* !< Resume counting */
#define GPTIMER_CTRCTL_FRB_CVAE_ACTION           ((uint32_t)0x00080000U)         /* !< Perform the action as specified by
                                                                                    the CVAE field. */
/* GPTIMER_CTRCTL[PLEN] Bits */
#define GPTIMER_CTRCTL_PLEN_OFS                  (24)                            /* !< PLEN Offset */
#define GPTIMER_CTRCTL_PLEN_MASK                 ((uint32_t)0x01000000U)         /* !< Phase Load Enable.  This bit allows
                                                                                    the timer to have phase load feature. */
#define GPTIMER_CTRCTL_PLEN_DISABLED             ((uint32_t)0x00000000U)         /* !< Disabled */
#define GPTIMER_CTRCTL_PLEN_ENABLED              ((uint32_t)0x01000000U)         /* !< Enabled */
/* GPTIMER_CTRCTL[SLZERCNEZ] Bits */
#define GPTIMER_CTRCTL_SLZERCNEZ_OFS             (23)                            /* !< SLZERCNEZ Offset */
#define GPTIMER_CTRCTL_SLZERCNEZ_MASK            ((uint32_t)0x00800000U)         /* !< Suppress Load and Zero Events if
                                                                                    Repeat Counter is Not Equal to Zero.
                                                                                    This bit suppresses the generation of
                                                                                    the Z (zero) and L (load) events from
                                                                                    the counter when the repeat counter
                                                                                    (RC) value is not 0. */
#define GPTIMER_CTRCTL_SLZERCNEZ_DISABLED        ((uint32_t)0x00000000U)         /* !< Disabled. Z and L events are always
                                                                                    generated from the counter when their
                                                                                    conditions are generated. */
#define GPTIMER_CTRCTL_SLZERCNEZ_ENABLED         ((uint32_t)0x00800000U)         /* !< Enabled. Z and L events are
                                                                                    generated from the counter when their
                                                                                    conditions are generated and the RC
                                                                                    register value is 0. */
/* GPTIMER_CTRCTL[CLC] Bits */
#define GPTIMER_CTRCTL_CLC_OFS                   (7)                             /* !< CLC Offset */
#define GPTIMER_CTRCTL_CLC_MASK                  ((uint32_t)0x00000380U)         /* !< Counter Load Control.  This field
                                                                                    specifies what controls the counter
                                                                                    operation with respect to setting the
                                                                                    counter to the LD register value.
                                                                                    Encodings 1-3 are present based on
                                                                                    the CCPC parameter value. Bits 4-5
                                                                                    are present based on the HQEI
                                                                                    parameter value. Any encodings not
                                                                                    provided are documented as reserved. */
#define GPTIMER_CTRCTL_CLC_CCCTL0_LCOND          ((uint32_t)0x00000000U)         /* !< CCCTL_0 LCOND */
#define GPTIMER_CTRCTL_CLC_CCCTL1_LCOND          ((uint32_t)0x00000080U)         /* !< CCCTL_1 LCOND */
#define GPTIMER_CTRCTL_CLC_CCCTL2_LCOND          ((uint32_t)0x00000100U)         /* !< CCCTL_2 LCOND This value exists
                                                                                    when there are 4 channels. */
#define GPTIMER_CTRCTL_CLC_CCCTL3_LCOND          ((uint32_t)0x00000180U)         /* !< CCCTL_3 LCOND This value exists
                                                                                    when there are 4 channels. */
#define GPTIMER_CTRCTL_CLC_QEI_2INP              ((uint32_t)0x00000200U)         /* !< Controlled by 2 input QEI mode.
                                                                                    This value exists when TIMER support
                                                                                    QEI feature. */
#define GPTIMER_CTRCTL_CLC_QEI_3INP              ((uint32_t)0x00000280U)         /* !< Controlled by 3 input QEI mode.
                                                                                    This value exists when TIMER support
                                                                                    QEI feature. */
/* GPTIMER_CTRCTL[CAC] Bits */
#define GPTIMER_CTRCTL_CAC_OFS                   (10)                            /* !< CAC Offset */
#define GPTIMER_CTRCTL_CAC_MASK                  ((uint32_t)0x00001C00U)         /* !< Counter Advance Control.  This
                                                                                    field specifies what controls the
                                                                                    counter operation with respect to
                                                                                    advancing (incrementing or
                                                                                    decrementing) the counter value.
                                                                                    Encodings 1-3 are present based on
                                                                                    the CCPC parameter value. Bits 4-5
                                                                                    are present based on the HQEI
                                                                                    parameter value. Any encodings not
                                                                                    provided are documented as reserved. */
#define GPTIMER_CTRCTL_CAC_CCCTL0_ACOND          ((uint32_t)0x00000000U)         /* !< CCCTL_0 ACOND */
#define GPTIMER_CTRCTL_CAC_CCCTL1_ACOND          ((uint32_t)0x00000400U)         /* !< CCCTL_1 ACOND */
#define GPTIMER_CTRCTL_CAC_CCCTL2_ACOND          ((uint32_t)0x00000800U)         /* !< CCCTL_2 ACOND This value exists
                                                                                    when there are 4 channels. */
#define GPTIMER_CTRCTL_CAC_CCCTL3_ACOND          ((uint32_t)0x00000C00U)         /* !< CCCTL_3 ACOND This value exists
                                                                                    when there are 4 channels. */
#define GPTIMER_CTRCTL_CAC_QEI_2INP              ((uint32_t)0x00001000U)         /* !< Controlled by 2-input QEI mode
                                                                                    This value exists when TIMER support
                                                                                    QEI feature. */
#define GPTIMER_CTRCTL_CAC_QEI_3INP              ((uint32_t)0x00001400U)         /* !< Controlled by 3-input QEI mode
                                                                                    This value exists when TIMER support
                                                                                    QEI feature. */
/* GPTIMER_CTRCTL[CZC] Bits */
#define GPTIMER_CTRCTL_CZC_OFS                   (13)                            /* !< CZC Offset */
#define GPTIMER_CTRCTL_CZC_MASK                  ((uint32_t)0x0000E000U)         /* !< Counter Zero Control This field
                                                                                    specifies what controls the counter
                                                                                    operation with respect to zeroing the
                                                                                    counter value.    Encodings 1-3 are
                                                                                    present based on the CCPC parameter
                                                                                    value. Bits 4-5 are present based on
                                                                                    the HQEI parameter value. Any
                                                                                    encodings not provided are documented
                                                                                    as reserved. */
#define GPTIMER_CTRCTL_CZC_CCCTL0_ZCOND          ((uint32_t)0x00000000U)         /* !< CCCTL_0 ZCOND */
#define GPTIMER_CTRCTL_CZC_CCCTL1_ZCOND          ((uint32_t)0x00002000U)         /* !< CCCTL_1 ZCOND */
#define GPTIMER_CTRCTL_CZC_CCCTL2_ZCOND          ((uint32_t)0x00004000U)         /* !< CCCTL_2 ZCOND This value exists
                                                                                    when there are 4 channels. */
#define GPTIMER_CTRCTL_CZC_CCCTL3_ZCOND          ((uint32_t)0x00006000U)         /* !< CCCTL_3 ZCOND This value exists
                                                                                    when there are 4 channels. */
#define GPTIMER_CTRCTL_CZC_QEI_2INP              ((uint32_t)0x00008000U)         /* !< Controlled by 2-input QEI mode
                                                                                    This value exists when TIMER support
                                                                                    QEI feature. */
#define GPTIMER_CTRCTL_CZC_QEI_3INP              ((uint32_t)0x0000A000U)         /* !< Controlled by 3-input QEI mode
                                                                                    This value exists when TIMER support
                                                                                    QEI feature. */

/* GPTIMER_LOAD Bits */
/* GPTIMER_LOAD[LD] Bits */
#define GPTIMER_LOAD_LD_OFS                      (0)                             /* !< LD Offset */
#define GPTIMER_LOAD_LD_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Load Value */
#define GPTIMER_LOAD_LD_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Minimum value */
#define GPTIMER_LOAD_LD_MAXIMUM                  ((uint32_t)0xFFFFFFFFU)         /* !< Maximum Value */

